In [1]:
import numpy as np
import pandas as pd

**FINDING MISSING DATA**

In [2]:
data ={
    'A' :[1,2,np.nan ,4,5],
    'B' :[np.nan , 2,3,4,5], 
    'C' :[1,2,3, np.nan , np.nan],
    'D' :[1, np.nan , np.nan , np.nan ,5] 
}
df = pd.DataFrame(data)
df

#np.nan means null values

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [3]:
df.isna()

       A      B      C      D
0  False   True  False  False
1  False  False  False   True
2   True  False  False   True
3  False  False   True   True
4  False  False   True  False

In [4]:
df.isna().sum()

A    1
B    1
C    2
D    3
dtype: int64

In [5]:
df.isna().any()

A    True
B    True
C    True
D    True
dtype: bool

**REMOVING NULL VALUES**

In [6]:
df

     A    B    C    D
0  1.0  NaN  1.0  1.0
1  2.0  2.0  2.0  NaN
2  NaN  3.0  3.0  NaN
3  4.0  4.0  NaN  NaN
4  5.0  5.0  NaN  5.0

In [7]:
df.dropna() # every row has atleast one null value so all rows get removed.

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [9]:
#but if
data1 ={
    'A' :[1,2,np.nan ,4,5],
    'B' :[1,2,3,4,5], 
    'C' :[1,2,3, np.nan , np.nan],
    'D' :[1, np.nan , np.nan , np.nan ,5] 
}
df1 = pd.DataFrame(data1)
df1

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [10]:
df1.dropna()

     A  B    C    D
0  1.0  1  1.0  1.0

In [11]:
#using threshold it means it have that amount of null values ex:-
df1.dropna(thresh=3)  #hav atleast three non null value

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

**FILLING THE MISSING DATA**)

In [12]:
df1.fillna(0)

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [16]:
values = {'A':0,'B':100,'C':300,'D':400}
df.fillna(value=values)

     A      B      C      D
0  1.0  100.0    1.0    1.0
1  2.0    2.0    2.0  400.0
2  0.0    3.0    3.0  400.0
3  4.0    4.0  300.0  400.0
4  5.0    5.0  300.0    5.0

In [17]:
df1

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

In [18]:
#to fill mean of data in place of NaN we do :- 
df.fillna(df.mean())

     A    B    C    D
0  1.0  3.5  1.0  1.0
1  2.0  2.0  2.0  3.0
2  3.0  3.0  3.0  3.0
3  4.0  4.0  2.0  3.0
4  5.0  5.0  2.0  5.0